Revit 2027 API
BuiltInFailures.RoofFailures.RoofToRefPlanes Property
 Roof cannot be joined to more than one reference plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoofToRefPlanes { get; }
Public Shared ReadOnly Property RoofToRefPlanes As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoofToRefPlanes {
	FailureDefinitionId^ get ();
}
static member RoofToRefPlanes : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace